; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v2 - type_3 ?v4 - type_1)
 	      (pred_3 ?v5 - object ?v4 - type_1)
	      (pred_2 ?v2 - type_3 ?v3 - type_2)
	      (pred_4 ?v2 - type_3 ?v5 - object ?v3 - type_2))

   (:action op_3
       :parameters  (?v2 - type_3 ?v7 ?v8 - type_1)
       :precondition (and  (pred_1 ?v2 ?v7))
       :effect (and  (pred_1 ?v2 ?v8)
		     (not (pred_1 ?v2 ?v7))))

   (:action op_1
       :parameters (?v2 - type_3 ?v1 - object ?v6 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v6) (pred_1 ?v2 ?v6) (pred_2 ?v2 ?v3))
       :effect (and (pred_4 ?v2 ?v1 ?v3)
		    (not (pred_3 ?v1 ?v6)) 
		    (not (pred_2 ?v2 ?v3))))

   (:action op_2
       :parameters (?v2 - type_3 ?v1 - object ?v6 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v1 ?v3) (pred_1 ?v2 ?v6))
       :effect (and (pred_3 ?v1 ?v6)
		    (pred_2 ?v2 ?v3)
		    (not (pred_4 ?v2 ?v1 ?v3)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_08 obj_09 - type_3
obj_05 obj_04 obj_07 obj_02 - type_2
obj_11 obj_06 obj_12 obj_03 - type_1
obj_10 obj_01 obj_13 - object)
(:init
(pred_1 obj_08 obj_12)
(pred_2 obj_08 obj_05)
(pred_2 obj_08 obj_04)
(pred_1 obj_09 obj_06)
(pred_2 obj_09 obj_07)
(pred_2 obj_09 obj_02)
(pred_3 obj_10 obj_12)
(pred_3 obj_01 obj_06)
(pred_3 obj_13 obj_06)
)
(:goal
(and
(pred_3 obj_10 obj_03)
(pred_3 obj_01 obj_03)
(pred_3 obj_13 obj_11)
)
)

(:constraints
  (always (not (pred_1 obj_08 obj_03)))
)
)

; plan
1. (op_1 obj_08 obj_10 obj_12 obj_04)
   deleted: (pred_3 obj_10 obj_12) (pred_2 obj_08 obj_04)
   added: (pred_4 obj_08 obj_10 obj_04)
   goals met: 0 of 3
2. (op_1 obj_09 obj_13 obj_06 obj_02)
   deleted: (pred_3 obj_13 obj_06) (pred_2 obj_09 obj_02)
   added: (pred_4 obj_09 obj_13 obj_02)
   goals met: 0 of 3
3. (op_1 obj_09 obj_01 obj_06 obj_07)
   deleted: (pred_3 obj_01 obj_06) (pred_2 obj_09 obj_07)
   added: (pred_4 obj_09 obj_01 obj_07)
   goals met: 0 of 3
4. (op_3 obj_09 obj_06 obj_03)
   deleted: (pred_1 obj_09 obj_06)
   added: (pred_1 obj_09 obj_03)
   goals met: 0 of 3
5. (op_3 obj_08 obj_12 obj_11)
   deleted: (pred_1 obj_08 obj_12)
   added: (pred_1 obj_08 obj_11)
   goals met: 0 of 3
6. (op_2 obj_09 obj_01 obj_03 obj_07)
   deleted: (pred_4 obj_09 obj_01 obj_07)
   added: (pred_3 obj_01 obj_03) (pred_2 obj_09 obj_07)
   goals met: 1 of 3
7. (op_2 obj_08 obj_10 obj_11 obj_04)
   deleted: (pred_4 obj_08 obj_10 obj_04)
   added: (pred_3 obj_10 obj_11) (pred_2 obj_08 obj_04)
   goals met: 1 of 3
8. (op_3 obj_09 obj_03 obj_11)
   deleted: (pred_1 obj_09 obj_03)
   added: (pred_1 obj_09 obj_11)
   goals met: 1 of 3
9. (op_2 obj_09 obj_13 obj_11 obj_02)
   deleted: (pred_4 obj_09 obj_13 obj_02)
   added: (pred_3 obj_13 obj_11) (pred_2 obj_09 obj_02)
   goals met: 2 of 3
10. (op_1 obj_09 obj_10 obj_11 obj_02)
   deleted: (pred_3 obj_10 obj_11) (pred_2 obj_09 obj_02)
   added: (pred_4 obj_09 obj_10 obj_02)
   goals met: 2 of 3
11. (op_3 obj_09 obj_11 obj_03)
   deleted: (pred_1 obj_09 obj_11)
   added: (pred_1 obj_09 obj_03)
   goals met: 2 of 3
12. (op_2 obj_09 obj_10 obj_03 obj_02)
   deleted: (pred_4 obj_09 obj_10 obj_02)
   added: (pred_3 obj_10 obj_03) (pred_2 obj_09 obj_02)
   goals met: 3 of 3
